---
title: RebarBendData
classe: Autodesk.Revit.DB.Structure.RebarBendData
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# RebarBendData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double BarModelDiameter { get; set; }` | `rebarBendData.BarModelDiameter` | Double |
| `Double BarNominalDiameter { get; set; }` | `rebarBendData.BarNominalDiameter` | Double |
| `Double BendRadius { get; set; }` | `rebarBendData.BendRadius` | Double |
| `Int32 HookAngle0 { get; set; }` | `rebarBendData.HookAngle0` | Int32 |
| `Int32 HookAngle1 { get; set; }` | `rebarBendData.HookAngle1` | Int32 |
| `Double HookBendRadius { get; set; }` | `rebarBendData.HookBendRadius` | Double |
| `Double HookLength0 { get; set; }` | `rebarBendData.HookLength0` | Double |
| `Double HookLength1 { get; set; }` | `rebarBendData.HookLength1` | Double |
| `RebarHookOrientation HookOrient0 { get; set; }` | `rebarBendData.HookOrient0` | RebarHookOrientation |
| `RebarHookOrientation HookOrient1 { get; set; }` | `rebarBendData.HookOrient1` | RebarHookOrientation |
| `Boolean IsValidObject { get; }` | `rebarBendData.IsValidObject` | Boolean |
| `Void Dispose()` | `rebarBendData.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```